export const penAscii = `
                                                          ######                                                                            
                                           ##-       ##     -######                                                             
                                         ##   +#####  ######      +##                                                           
                                       ##   ##         ##    ##                                                                 
                                      #+ ###   +#         #######   -#                                                          
                                    # + #                            ##                                                         
                                   ## #             .#                ##                                                        
                                   #+ ##     -      ##                 -##                                                      
                                  #-#  #      ##    #             - ####  ###                                                   
                                 ##  # ##         +##            ##    #### .##                                                 
###                              # -#  # #.    + ###             #           ##                                                 
  -################+.           +# #. ##############            #            ##                                                 
   #. +#######+####+.############    ##        .###            #.             ##                                                
 ### .##################-     #######             ##         ##           ##    ###                                             
 # #         #######################     #.        ######   ##           ##  ##    ##                                           
 # #               +###########-.#+      ##         #   #####            #          ##                                          
 # #                      .######                   ###-   ##          ##        #  ##                                          
 # #                          #           ####             #         ##          #+ #.                                          
 ###                        ##             .#####+ #.    .#         ##          ######-                                         
  ##                       -##            ###.########### #        #           #############                                    
  ##                       ##          ####    ###.  +# ### #+   ##+         ######++########## ###+                            
 ####                       #                    ##-  ###############      #######################  ######                      
 +# #                       ##      ##-           ##+.# -#++### +## ########################++###  # # #- +##########           
  ## ##                      ##           ##        #######     -#  + ########  .################  + #      #        ###        
  -#  -##                    ##+       ##            #    #####.  ######   -   +##             +##########-#####    . -  ###+   
   #.    ##                   ##                     ##     ## ##        # ##  ##                          ###-################ 
    # ##   ##                  -#                     ##     ##   # +#-       ##                                                
    ## -##   ##                 ##+                   ##         #- ##        #+                                                
    ###  ###  #+                ####                   #    #         ##     ##                                                 
    .#    # #  #                 ####                  ##  #+               ##                                                  
     ##   # ## #                  ####                   ###                #                                                   
      ## .#### #                   ####                 # #  #          . ##                                                    
        #  ##                       ####             -## ##  ##          ###                                                    
                                    .####  #.       .#        ##     ###-##                                                     
                                      -###  .#         ##         ##-  ###                                                      
                                        #####  ###     ## #+    #     ##                                                        
                                          ####   .     #             ##-                                                        
                                          ## ##  #  ## #             ###                                                        
                                          ##  ####     +              ##                                                        
                                          ##    #. #  #               ###                                                       
                                          ##     #   ##                ##                                                       
                                          #      #                      #                                                       
                                         ##                             #                                                       
                                         ##                            ##                                                     
`;

export enum subject {
  BTC = 0,
  FINANCE = 1,
  INTERNET = 2,
  STORY = 3,
  RESEARCH = 4,
}

const btc = "₿";
const finance = "[̲̅$̲̅(̲̅ιο̲̅̅)̲̅$̲̅]";

const internet = `ଘ(੭*ˊᵕˋ)੭*  ɪɴᴛᴇʀɴᴇᴛ`;

const story = "	༼ つ ◕_◕ ༽つ";
const research = "	•͡˘㇁•͡˘";

interface Subject {
  headline: string;
  subject: subject;
  ascii: string;
}

export const subjects: Subject[] = [
  {
    headline: "BTC",
    ascii: btc,
    subject: subject.BTC,
  },
  {
    headline: "finance",
    ascii: finance,
    subject: subject.FINANCE,
  },
  {
    headline: "internet",
    ascii: internet,
    subject: subject.INTERNET,
  },
  {
    headline: "story",
    ascii: story,
    subject: subject.STORY,
  },
  {
    headline: "research",
    ascii: research,
    subject: subject.RESEARCH,
  },
];
